---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.RbsElecPanelFeedThruLugsApparentLoadPhasec
source: html/f2b98929-9550-3457-0ec6-d0e0a9110b97.htm
---
# Autodesk.Revit.DB.ParameterTypeId.RbsElecPanelFeedThruLugsApparentLoadPhasec Property

"Feed Through Lugs Apparent Load Phase C"

## Syntax (C#)
```csharp
public static ForgeTypeId RbsElecPanelFeedThruLugsApparentLoadPhasec { get; }
```